#+TITLE:   Doom Emacs Config
#+DATE:    December 15, 2020
#+SINCE:  1.0
#+STARTUP: inlineimages nofold
#+PROPERTY: header-args :tangle config.el

** Package config
#+begin_src elisp
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
#+end_src

#+RESULTS:
: ((melpa . https://melpa.org/packages/) (org . https://orgmode.org/elpa/) (elpa . https://elpa.gnu.org/packages/))

